snlkuharlocal/src/InformationRegisters/СтатусыОтложеннойОбработкиДокументов/СтатусыОтложеннойОбработкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыОтложеннойОбработкиДокументов</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </resources>
  <attributes>
    <name>Ошибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ХранилищеКодовМаркировки</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/СтатусыОтложеннойОбработкиДокументов/ManagerModule.bsl
Функция УстановитьСтатус(ДокСсылка, Статус) Экспорт
	МЗ = РегистрыСведений.СтатусыОтложеннойОбработкиДокументов.СоздатьМенеджерЗаписи();
	
	МЗ.Документ = ДокСсылка;
	МЗ.Статус	= Статус;
	
	Если ЗначениеЗаполнено(МЗ.Документ) Тогда	
		МЗ.Записать();			
	КонецЕсли;
КонецФункции //УстановитьСтатус(ДокСсылка, Статус) Экспорт
